---
title: "List Unique Values In A pandas Column"
author: "Chris Albon"
date: 2017-12-20T11:53:49-07:00
description: "List unique values in a pandas column."
type: technical_note
draft: false
aliases:
    - /python/pandas_list_unique_values_in_column.html
---

Special thanks to Bob Haffner for pointing out a better way of doing it.

## Preliminaries

In [2]:
# Import modules
import pandas as pd

# Set ipython's max row display
pd.set_option('display.max_row', 1000)

# Set iPython's max column width to 50
pd.set_option('display.max_columns', 50)

## Create an example dataframe

In [14]:
# Create an example dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy','Ana'], 
        'year': [2012, 2012, 2013, 2014, 2014,2015], 
        'reports': [4, 24, 31, 2, 3,3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma','Yoyo'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3
Yoyo          Ana  2015        3

## List unique values

In [4]:
#List unique values in the df['name'] column
df.name.unique()

array(['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], dtype=object)

In [15]:
df.apply(pd.value_counts)
df.apply(lambda x: pd.Series(pd.unique(x)))

C:\Users\I343785\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\indexes\api.py:107: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  result = result.union(other)

    name    year  reports
0  Jason  2012.0      4.0
1  Molly  2013.0     24.0
2   Tina  2014.0     31.0
3   Jake  2015.0      2.0
4    Amy     NaN      3.0
5    Ana     NaN      NaN